[
    {
      "name": "Carlos V",
      "thumb": "/images/trip_advisor_reviews/default-avatar-2020-38.webp",
      "date": "2024-01-24",
      "title": "Machupicchu day",
      "review": "One of the best experiences of my life. Every human being should visit this place at least once in their lifetime. I hope to come back soon. Special thanks to our guide Miguel for his attention, kindness, and detailed explanations. I highly recommend it 100%."
    },
    {
      "name": "Andrea M",
      "thumb": "/images/trip_advisor_reviews/default-avatar-2020-10.webp",
      "date": "2024-01-21",
      "title": "Majestic",
      "review": "An unforgettable experience. The guide was very kind, very patient with the photos, and a great photographer. Everything was very well organized, and the lunch place he took us to was delicious."
    },
    {
      "name": "Jacob W",
      "thumb": "/images/trip_advisor_reviews/default-avatar-2020-69.webp",
      "date": "2024-01-20",
      "title": "Great experience on Machu Picchu day trip",
      "review": "We did a day trip tour of Machu Picchu from Cusco, and the travel agency handled every aspect from our Airbnb and back. Our guide Roy was amazing, very knowledgeable, and fun to be around. The views were amazing, from the bus ride to the top of Machu Picchu! Highly recommend."
    },
    {
      "name": "Laura Camila Silva",
      "thumb": "/images/trip_advisor_reviews/noprofile-08.webp",
      "date": "2024-01-18",
      "title": "Amazing experience",
      "review": "I recommend Mr. Miguel, an amazing guide and person for this experience! Good price, timing, everything was great! Thanks for everything."
    },
    {
      "name": "Adam B",
      "thumb": "/images/trip_advisor_reviews/default-avatar-2020-49.webp",
      "date": "2024-02-05",
      "title": "Worth it",
      "review": "It’s exactly what you think it would be like... awesome! Amazing views, great culture. All around, an amazing experience. Miguel was fantastic. He knew all the best spots for pictures. Highly recommend."
    },
    {
      "name": "Virkin123",
      "thumb": "/images/trip_advisor_reviews/noprofile-06.webp",
      "date": "2024-02-02",
      "title": "Far exceeded our expectations",
      "review": "These folks took care of every detail. Impeccable, timely service. When there was an issue (an unplanned strike), this company moved heaven and earth to make sure we still got to see Machu Picchu. Our guide, Roiyl, did a fantastic job providing context to the main attraction. He was very considerate of our every need. The food was excellent, and transportation was great. I would recommend this company and this tour to anyone planning a visit."
    },
    {
      "name": "Chervon S",
      "thumb": "/images/trip_advisor_reviews/chervon-s.webp",
      "date": "2024-02-02",
      "title": "Unforgettable Experience",
      "review": "Amazing tour. It was well planned and guided. Our tour guide Rony was so professional and knowledgeable. He made our day at Machu Picchu the best experience ever."
    },
    {
      "name": "Alfonso Vázquez",
      "thumb": "/images/trip_advisor_reviews/javi-jrz.webp",
      "date": "2024-02-01",
      "title": "Highly recommended",
      "review": "Once in Ollantaytambo, the experience was incredible from start to finish. In Machu Picchu, our guide Miguel gave us a very complete history lesson according to the tourist circuit we chose (1 and 2). I totally recommend choosing this company for your visit to Machu Picchu. They take care of every detail to ensure you arrive and return completely satisfied with the experience."
    },
    {
      "name": "Jehan E",
      "thumb": "/images/trip_advisor_reviews/default-avatar-2020-14.webp",
      "date": "2024-01-27",
      "title": "Book them for a stress-free way to get to Machu Picchu!",
      "review": "Morning pick-up was prompt, and the van we rode in was very spacious and comfortable. We were escorted directly to the train station where we boarded the PeruRail. I recommend the Vistadome so you get a great view of everything! Our guide, Roy, was amazing! He took his time to explain things and took really great pictures of us! He also walked us to a restaurant he recommended. We really loved our experience. Best of all, they refunded us the price we paid for our 2-year-old (since 2-year-olds enter Machu Picchu for free)."
    },
    {
      "name": "Stewart M",
      "thumb": "/images/trip_advisor_reviews/default-avatar-2020-42.webp",
      "date": "2024-01-25",
      "title": "Great trip",
      "review": "Machu Picchu was amazing! Everything was expertly organized by the company and well worth the extra cost. Our guide Roy was very knowledgeable and a great character. Thanks for the wonderful day, Roy!"
    }
  ]